sfjagsf/m-c-x-a-1-7-6/MCXA176_V6.3/app/driver/GpioDmaFilter.c
#include "GpioDmaFilter.h"

#include "fsl_ctimer.h"
#include "peripherals.h"

/* This symbol is referenced by the Config Tools generated DMA configuration. */
volatile uint32_t g_gpio3SampleBuf[GPIO_DMA_FILTER_SAMPLE_COUNT];

static volatile uint32_t s_gpio3FilteredPdir;
static volatile uint32_t s_dmaErrorCount;

static bool GpioDmaFilterArm(void)
{
    status_t status;

    status = EDMA_SubmitTransfer(&DMA0_CH7_Handle, &DMA0_CH7_TRANSFER0_CONFIG);
    if (status != kStatus_Success)
    {
        s_dmaErrorCount++;
        return false;
    }

    EDMA_StartTransfer(&DMA0_CH7_Handle);
    return true;
}

static void GpioDmaFilterUpdate(void)
{
    uint32_t filtered;
    uint32_t pinMask;

    /* Bits outside the five inputs always retain the live GPIO3 state. */
    filtered = GPIO3->PDIR & ~GPIO_DMA_FILTER_MASK;

    for (pinMask = GPIO_DMA_FILTER_IN5_MASK; pinMask <= GPIO_DMA_FILTER_IN7_MASK; pinMask <<= 1U)
    {
        uint32_t highCount = 0U;
        uint32_t index;

        for (index = 0U; index < GPIO_DMA_FILTER_SAMPLE_COUNT; index++)
        {
            if ((g_gpio3SampleBuf[index] & pinMask) != 0U)
            {
                highCount++;
            }
        }

        /* Eight samples: five or more high samples means a filtered high. */
        if (highCount >= ((GPIO_DMA_FILTER_SAMPLE_COUNT / 2U) + 1U))
        {
            filtered |= pinMask;
        }
    }

    s_gpio3FilteredPdir = filtered;
}

void GpioDmaFilterDmaCallback(edma_handle_t *handle, void *userData, bool transferDone, uint32_t tcds)
{
    (void)handle;
    (void)userData;
    (void)tcds;

    if (!transferDone)
    {
        s_dmaErrorCount++;
        return;
    }

    GpioDmaFilterUpdate();
    (void)GpioDmaFilterArm();
}

bool GpioDmaFilterStart(void)
{
    uint32_t index;

    CTIMER_StopTimer(CTIMER4);
    EDMA_AbortTransfer(&DMA0_CH7_Handle);
    CTIMER_Reset(CTIMER4);

    for (index = 0U; index < GPIO_DMA_FILTER_SAMPLE_COUNT; index++)
    {
        g_gpio3SampleBuf[index] = 0U;
    }

    /* Before the first 800-us DMA window completes, publish the live level. */
    s_gpio3FilteredPdir = GPIO3->PDIR;
    s_dmaErrorCount     = 0U;

    if (!GpioDmaFilterArm())
    {
        return false;
    }

    CTIMER_StartTimer(CTIMER4);
    return true;
}

uint32_t GpioDmaFilterGetPortState(void)
{
    return s_gpio3FilteredPdir;
}

bool GpioDmaFilterReadPin(uint32_t pinMask)
{
    return (GpioDmaFilterGetPortState() & pinMask) != 0U;
}

uint32_t GpioDmaFilterGetErrorCount(void)
{
    return s_dmaErrorCount;
}
